<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1,3,224,224" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_51688" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 2304" offset="0" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_51680" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 2304" offset="9216" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_51672" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 2304" offset="18432" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_51664" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 2304" offset="27648" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_51656" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 2304" offset="36864" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_51648" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 2304" offset="46080" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_51640" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 2304" offset="55296" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_51632" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 2304" offset="64512" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_51624" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 2304" offset="73728" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_51616" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 2304" offset="82944" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_51608" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 2304" offset="92160" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_51600" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 2304" offset="101376" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="class_token" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="110592" size="3072" />
			<output>
				<port id="0" precision="FP32" names="class_token">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_50871" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="113664" size="12" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Multiply_50873" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_50875" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="113676" size="12" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Divide_7395" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv_proj.weight" type="Const" version="opset1">
			<data element_type="f32" shape="768, 3, 16, 16" offset="113688" size="2359296" />
			<output>
				<port id="0" precision="FP32" names="conv_proj.weight">
					<dim>768</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/conv_proj/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="16, 16" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Reshape_188" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768, 1, 1" offset="2472984" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/conv_proj/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/conv_proj/Conv_output_0">
					<dim>1</dim>
					<dim>768</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/Shape_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Shape_1_output_0,/Shape_2_output_0,/Shape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_45150" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_157" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="25" name="/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Gather_output_0,/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476064" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2476072" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_3_output_0" />
			</output>
		</layer>
		<layer id="28" name="Constant_162" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="29" name="/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="30" name="/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2476080" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_5_output_0" />
			</output>
		</layer>
		<layer id="31" name="/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/Cast_1_output_0,/Cast_output_0,/Div_output_0" />
			</output>
		</layer>
		<layer id="32" name="/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2476088" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_4_output_0" />
			</output>
		</layer>
		<layer id="33" name="Constant_166" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="34" name="/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Gather_2_output_0" />
			</output>
		</layer>
		<layer id="35" name="/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2476080" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_6_output_0" />
			</output>
		</layer>
		<layer id="36" name="/Div_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/Cast_2_output_0,/Cast_3_output_0,/Div_1_output_0" />
			</output>
		</layer>
		<layer id="37" name="/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/Mul_output_0" />
			</output>
		</layer>
		<layer id="38" name="Constant_740" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_181">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Unsqueeze_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/Concat_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Reshape_output_0">
					<dim>1</dim>
					<dim>768</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_310" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="2476096" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Transpose_output_0">
					<dim>1</dim>
					<dim>196</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/Shape_3" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>196</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Shape_3_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_45155" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_314" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="47" name="/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Gather_3_output_0,/Unsqueeze_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476120" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476120" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/Concat_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_11967" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476120" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Reshape_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/Mul_1" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="2476128" size="24" />
			<output>
				<port id="0" precision="I64" names="/Mul_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/Equal_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/ConstantOfShape" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="2476152" size="24" />
			<output>
				<port id="0" precision="I64" names="/ConstantOfShape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/Where" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/Where_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/Expand" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Expand_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/Concat_2" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>196</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Concat_2_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="encoder.pos_embedding" type="Const" version="opset1">
			<data element_type="f32" shape="1, 197, 768" offset="2476176" size="605184" />
			<output>
				<port id="0" precision="FP32" names="encoder.pos_embedding">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/encoder/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/Add_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_361" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476120" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/encoder/layers/encoder_layer_0/ln_1/Div" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layers/encoder_layer_0/ln_1/Div_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_51598" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="3081360" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/encoder/layers/encoder_layer_0/ln_1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layers/encoder_layer_0/ln_1/Mul_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_51599" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="3084432" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/encoder/layers/encoder_layer_0/ln_1/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layers/encoder_layer_0/ln_1/Add_1_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_374" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="3087504" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/encoder/layers/encoder_layer_0/self_attention/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layers/encoder_layer_0/self_attention/Transpose_output_0">
					<dim>197</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Transpose_50722" type="Const" version="opset1">
			<data element_type="f32" shape="2304, 768" offset="3087528" size="7077888" />
			<output>
				<port id="0" precision="FP32">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/encoder/layers/encoder_layer_0/self_attention/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>197</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layers/encoder_layer_0/self_attention/MatMul_output_0">
					<dim>197</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/encoder/layers/encoder_layer_0/self_attention/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>197</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layers/encoder_layer_0/self_attention/Add_output_0">
					<dim>197</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/encoder/layers/encoder_layer_0/self_attention/Shape_4" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>197</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Shape_4_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/encoder/layers/encoder_layer_0/self_attention/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/encoder/layers/encoder_layer_0/self_attention/Reshape" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476072" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Reshape_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Broadcast_422" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10165416" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/encoder/layers/encoder_layer_0/self_attention/Slice_1" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Slice_1_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/encoder/layers/encoder_layer_0/self_attention/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476088" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Constant_8_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/encoder/layers/encoder_layer_0/self_attention/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>197</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Shape_1_output_0,/encoder/layers/encoder_layer_0/self_attention/Shape_2_output_0,/encoder/layers/encoder_layer_0/self_attention/Shape_3_output_0,/encoder/layers/encoder_layer_0/self_attention/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/encoder/layers/encoder_layer_0/self_attention/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476120" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/encoder/layers/encoder_layer_0/self_attention/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10165424" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Broadcast_398" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10165416" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/encoder/layers/encoder_layer_0/self_attention/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Slice_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/encoder/layers/encoder_layer_0/self_attention/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Constant_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/encoder/layers/encoder_layer_0/self_attention/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Squeeze_output_0" />
			</output>
		</layer>
		<layer id="85" name="Constant_799" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_245">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/encoder/layers/encoder_layer_0/self_attention/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/encoder/layers/encoder_layer_0/self_attention/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Concat_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/encoder/layers/encoder_layer_0/self_attention/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Concat_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/encoder/layers/encoder_layer_0/self_attention/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>197</dim>
					<dim>1</dim>
					<dim>2304</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layers/encoder_layer_0/self_attention/Reshape_2_output_0">
					<dim>197</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/encoder/layers/encoder_layer_0/self_attention/Constant_16" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Constant_16_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>197</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_1_output_0">
					<dim>1</dim>
					<dim>197</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_50178" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Squeeze_50179" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>197</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_50180" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="10165432" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/encoder/layers/encoder_layer_0/self_attention/Squeeze_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>197</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layers/encoder_layer_0/self_attention/Squeeze_1_output_0">
					<dim>3</dim>
					<dim>197</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_output_0" />
			</output>
		</layer>
		<layer id="97" name="Constant_457" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="98" name="/encoder/layers/encoder_layer_0/self_attention/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>197</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/encoder/layers/encoder_layer_0/self_attention/Gather_3_output_0">
					<dim>197</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_45160" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_378" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="101" name="/encoder/layers/encoder_layer_0/self_attention/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Gather_output_0,/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_10_output_0,/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_20_output_0,/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/encoder/layers/encoder_layer_0/self_attention/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="10165416" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="103" name="Constant_382" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="104" name="/encoder/layers/encoder_layer_0/self_attention/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="105" name="/encoder/layers/encoder_layer_0/self_attention/Constant_18" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="10165464" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Constant_18_output_0" />
			</output>
		</layer>
		<layer id="106" name="/encoder/layers/encoder_layer_0/self_attention/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Mul_output_0" />
			</output>
		</layer>
		<layer id="107" name="Constant_846" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_298">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_7" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_3_output_0,/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_5_output_0,/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/encoder/layers/encoder_layer_0/self_attention/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2476072" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="110" name="Constant_386" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="111" name="/encoder/layers/encoder_layer_0/self_attention/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Gather_2_output_0" />
			</output>
		</layer>
		<layer id="112" name="/encoder/layers/encoder_layer_0/self_attention/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="10165464" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Constant_3_output_0" />
			</output>
		</layer>
		<layer id="113" name="/encoder/layers/encoder_layer_0/self_attention/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Cast_1_output_0,/encoder/layers/encoder_layer_0/self_attention/Cast_output_0,/encoder/layers/encoder_layer_0/self_attention/Div_output_0" />
			</output>
		</layer>
		<layer id="114" name="Constant_878" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_334">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_17" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_11_output_0,/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_14_output_0,/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_17_output_0,/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_4_output_0,/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_6_output_0,/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_8_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="/encoder/layers/encoder_layer_0/self_attention/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Concat_2_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="/encoder/layers/encoder_layer_0/self_attention/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>197</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layers/encoder_layer_0/self_attention/Reshape_3_output_0">
					<dim>197</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Constant_529" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="3087504" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="/encoder/layers/encoder_layer_0/self_attention/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>197</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layers/encoder_layer_0/self_attention/Transpose_2_output_0">
					<dim>12</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_914" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476056" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_370">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_21" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_12_output_0,/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_15_output_0,/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_21_output_0,/encoder/layers/encoder_layer_0/self_attention/Unsqueeze_9_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="/encoder/layers/encoder_layer_0/self_attention/Constant_22" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10165464" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Constant_22_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="/encoder/layers/encoder_layer_0/self_attention/Concat_5" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Concat_5_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="/encoder/layers/encoder_layer_0/self_attention/Reshape_6" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>12</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/layers/encoder_layer_0/self_attention/Reshape_6_output_0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="/encoder/layers/encoder_layer_0/self_attention/Constant_27" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="10165472" size="4" />
			<output>
				<port id="0" precision="FP32" names="/encoder/layers/encoder_layer_0/self_attention/Constant_27_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="/encoder/layers/encoder_layer_0/self_attention/Shape_6" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Shape_6_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="/encoder/layers/encoder_layer_0/self_attention/Constant_25" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2476120" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Constant_25_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="/encoder/layers/encoder_layer_0/self_attention/Constant_26" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10165424" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Constant_26_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Broadcast_865" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10165416" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="/encoder/layers/encoder_layer_0/self_attention/Slice_3" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/encoder/layers/encoder_layer_0/self_attention/Slice_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="/encoder/layers/encoder_layer_0/self_attention/Cast_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/layers/encoder_layer_0/self_attention/Cast_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="/encoder/layers/encoder_layer_0/self_attention/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/layers/encoder_layer_0/self_attention/Sqrt_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
